using UnityEngine;

namespace ShiroGe.Scripts.Utils
{
    [CreateAssetMenu(fileName = "NPCNames", menuName = "NPC/NameList")]
    public class NPCNamesDatabase : ScriptableObject
    {
        public string[] firstNames = {
            "Альдрик", "Бернард", "Вернер", "Герхард", "Дитрих", "Зигфрид",
            "Конрад", "Людвиг", "Магнус", "Николаус", "Отто", "Райнхарт",
            "Стефан", "Торбен", "Ульрих", "Фальк", "Хельмут", "Цезариус",
            "Эдгар", "Юрген", "Юлиус", "Бьорн", "Баруч",
            "Вернер", "Вельф", "Грегор", "Гаррох", "Дитрих", "Джура",
            "Эдрик", "Эрих", "Зигмунд", "Зелл", "Ингвар", "Ирвин",
            "Кассиан", "Кроули", "Леонард", "Леон", "Магнус", "Майлз",
            "Николаус", "Найджел", "Олдрик", "Орландо", "Райнер",
            "Рангар", "Стефан", "Слейн", "Тиберий", "Торбьорн",
            "Ульрих", "Ульф", "Фалько", "Флинн", "Хельмут", "Хейзен",
            "Цезариус", "Эртан", "Отто", "Рейнхарт", "Юлиус", "Феррис",
            "Вильгельм", "Аль", "Розвааль", "Леон", "Вельф", "Белл",
            "Финн", "Гарет", "Бете", "Хегни", "Цецилиус", "Олбарт",
            "Гил", "Зелл", "Кромвель"
        };
    
        public string[] lastNames = {
            "Айзенбах", "Брауншвейг", "Вальдштайн", "Готлиб", "Дракенфельс",
            "Зильберманн", "Кёнигсберг", "Лихтенберг", "Моргенштерн",
            "Нордфельд", "Ротенберг", "Шварцвальд", "Тальберг", "Ульрихсхофен",
            "Фельдман", "Хоффман", "Штайнберг", "Эйзенберг", "Юнгфельд", "Вайсс",
            "Юклиус", "Астерия", "Блэкторн", "Браун", "Вальдштайн", "Вольфганг",
            "Грейстоун", "Гринвуд", "Дракенфельс", "Джетур", "Айронвуд", "Колбранд",
            "Зильберманн", "Зальцман", "Краус", "Кресс", "Лайтвуд", "Локхарт",
            "Миттель", "Нордфельд", "Норман", "О’Брайан", "Орландо",
            "Ротенберг", "Рэйвенкрофт", "Сеймур", "Тальберг", "Торн",
            "Ульфхейм", "Уинтерс", "Хардвик", "Шторм", "Штраус", "Юнгфельд", "Ярл", "Астерия",
            "Ван Астрея", "Аргайл", "Карстен", "Урсарис", "Конвелл", "Кроццо", "Локхарт",
            "Хирютэ", "Логос", "Фрейя", "Вальдек", "Фолкенрат", "Грэм", "Штормвейл", "Торбенсон",
            "Лидс", "Хейзен"
        };
        
    }
}